In [1]:
# command +shift +c  then select the mode to dark

In [2]:
import pandas as pd

In [3]:
pwd

'/Users/olivierla412/projects/DataTrained_live_classes/Imputer_Encoder'

In [4]:
df = pd.DataFrame({
    'fare':[25,48,71,85,90,120],
    'Embarked':['S','C','S','S','C','Q'],
    'Gender':['male','female','male','female','male','female'],
    'Age':[22,34,54,29,55,None]
})
df

   fare Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S    male  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q  female   NaN

### __Encoder__ and __Imputer__

#### __Encoder__:
###### It helps to convert text into numbers.

#### LabelEncoder() method

In [5]:
# Instantiate the method.
from sklearn.preprocessing import LabelEncoder

In [6]:
lab_enc = LabelEncoder()

In [7]:
df1 = lab_enc.fit_transform(df['Embarked'])

pd.Series(df1)

0    2
1    0
2    2
3    2
4    0
5    1
dtype: int64

In [8]:
## update the column Embarked values in the dataset

df['Embarked'] = df1
df

   fare  Embarked  Gender   Age
0    25         2    male  22.0
1    48         0  female  34.0
2    71         2    male  54.0
3    85         2  female  29.0
4    90         0    male  55.0
5   120         1  female   NaN

In [9]:
df2 = lab_enc.fit_transform(df['Gender'])

In [10]:
df['Gender'] = df2
df

   fare  Embarked  Gender   Age
0    25         2       1  22.0
1    48         0       0  34.0
2    71         2       1  54.0
3    85         2       0  29.0
4    90         0       1  55.0
5   120         1       0   NaN

#### OneHotEncoder() method

In [11]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.compose import make_column_transformer

In [12]:
## Instantiation

ohe =  OneHotEncoder()
si = SimpleImputer()

In [13]:
df_ = pd.DataFrame({
    'fare':[25,48,71,85,90,120],
    'Embarked':['S','C','S','S','C','Q'],
    'Gender':['male','female','male','female','male','female'],
    'Age':[22,34,54,29,55,None]
})
df_

   fare Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S    male  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q  female   NaN

In [14]:
##### Imputer ,It means Imputation ==> fill NAN     


ct = make_column_transformer(
(ohe,['Embarked','Gender']),    #this will Encode 'Embarked','Gender' columns
(si,['Age']),   #This will fill the NaN in Age column
remainder='passthrough')   # 'passthrogh' to keep all other columns 

## SimpleImputer() can tanke more than 1 column / (si,['Age','col2','col3',...,coln])

# This is the best option to fill the NAN values if the dataset have more
# columns with missing values .

In [18]:
transformed_data = ct.fit_transform(df_)

# the firest 3 columns are : C  Q  S 
#                             0  0  1 ( row = 0)
#                             1  0  0 ( row = 1)
#                             0  0  1 ( row = 2)

In [24]:
transformed_data

array([[  0. ,   0. ,   1. ,   0. ,   1. ,  22. ,  25. ],
       [  1. ,   0. ,   0. ,   1. ,   0. ,  34. ,  48. ],
       [  0. ,   0. ,   1. ,   0. ,   1. ,  54. ,  71. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  29. ,  85. ],
       [  1. ,   0. ,   0. ,   0. ,   1. ,  55. ,  90. ],
       [  0. ,   1. ,   0. ,   1. ,   0. ,  38.8, 120. ]])

## Ordinal Encoder

#### Ordinal data, means ordered data

In [27]:
from sklearn.preprocessing import OrdinalEncoder

In [26]:

import pandas as pd 

df_1 = pd.DataFrame({
    'Shape':['square','Oval','square','circle'],
    'Classe':['third','first','second','first'],
    'Size':['M','S','XL','M']
    
})
df_1

    Shape  Classe Size
0  square   third    M
1    Oval   first    S
2  square  second   XL
3  circle   first    M

In [29]:
ord_enc = OrdinalEncoder(categories= [['first','second','third'],['S','M','XL']])
df_1f = ord_enc.fit_transform(df_1[['Classe','Size']])

## Expected 2D array, got 1D array instead
# above error will appier if you try a single column with OrdinalEncoder

In [31]:
df_1f

array([[2., 1.],
       [0., 0.],
       [1., 2.],
       [0., 1.]])

In [32]:
df_1['Classe'] = df_1f[:,0]

In [33]:
df_1['Size'] = df_1f[:,1]

In [34]:
df_1

    Shape  Classe  Size
0  square     2.0   1.0
1    Oval     0.0   0.0
2  square     1.0   2.0
3  circle     0.0   1.0

## Binary Encoder

In [35]:
import pandas as pd 

df_2 = pd.DataFrame({'Cat_data':['A','B','C','D','E','F','G','H','I','A','A','D']})
df_2

   Cat_data
0         A
1         B
2         C
3         D
4         E
5         F
6         G
7         H
8         I
9         A
10        A
11        D

In [39]:
from category_encoders import BinaryEncoder

### pip install --upgrade category_encoders

In [40]:
bi_enc = BinaryEncoder()

In [41]:
df_bi = bi_enc.fit_transform(df_2)
df_bi

/opt/anaconda3/lib/python3.8/site-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

    Cat_data_0  Cat_data_1  Cat_data_2  Cat_data_3  Cat_data_4
0            0           0           0           0           1
1            0           0           0           1           0
2            0           0           0           1           1
3            0           0           1           0           0
4            0           0           1           0           1
5            0           0           1           1           0
6            0           0           1           1           1
7            0           1           0           0           0
8            0           1           0           0           1
9            0           0           0           0           1
10           0           0           0           0           1
11           0           0           1           0           0

In [42]:
type(df_bi)

pandas.core.frame.DataFrame

In [48]:
df_bi.iloc[0]

Cat_data_0    0
Cat_data_1    0
Cat_data_2    0
Cat_data_3    0
Cat_data_4    1
Name: 0, dtype: int64

# Knn Imputer
#### It's very popular used for filling NaN values

In [49]:
df_3 = pd.DataFrame({
    'fare':[25,48,71,85,90,120],
    'Embarked':['S','C','S','S','C','Q'],
    'Gender':['male','female','male','female','male','female'],
    'Age':[22,34,54,29,55,None]
})
df_3

   fare Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S    male  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q  female   NaN

In [50]:
# Knn imputer will try to find the relation with other column and impute the data
# according the relaton with other columns.
# In this case Age NaN is depending on the similarity with faire columns

from sklearn.impute import KNNImputer

In [59]:
knn_ipm = KNNImputer(n_neighbors=2)

In [61]:
knn_ipm.fit_transform(df_3[['fare','Age']])

## x = 'faire', and y = 'Age'
## you can give more than 2 columns as y values , 'fare','Money','Area','Age'

array([[ 25.,  22.],
       [ 48.,  34.],
       [ 71.,  54.],
       [ 85.,  29.],
       [ 90.,  55.],
       [120.,  42.]])

## Iterative Imputer

##### This method treats other columns (which doesnot have nulls as feature and train on them and treat null column as label.
##### Finally it will predict the NaN data and impute. Its just like regression problem. Here null column is labe

##### It will predict the NaN values.....

In [63]:
# Before using Iterative Imputer we need to enable it using the below code
from sklearn.experimental import enable_iterative_imputer

# Import iterative imputer
from sklearn.impute import IterativeImputer

In [71]:
df_4 = pd.DataFrame({
    'fare':[25,48,71,85,90,120,48],
    'Embarked':['S','C','S','S','C','Q','C'],
    'Gender':['male','female','male','female','male','female','female'],
    'Age':[22,34,54,29,55,None,None]
})
df_4

   fare Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S    male  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q  female   NaN
6    48        C  female   NaN

In [72]:
iter_impute = IterativeImputer()

In [73]:
iter_impute.fit_transform(df_4[['fare','Age']])

## predict the NaN in 'Age' according to the 'faire' column

# so It will treat 'faire' as feature and 'Age' as label.

# you can use round() to round the replace NAN values

array([[ 25.        ,  22.        ],
       [ 48.        ,  34.        ],
       [ 71.        ,  54.        ],
       [ 85.        ,  29.        ],
       [ 90.        ,  55.        ],
       [120.        ,  52.03920049],
       [ 48.        ,  35.07794719]])

# End of Encoding Technics

In [10]:
pwd

'/Users/olivierla412/projects/DataTrained_live_classes/Imputer_Encoder'